//AJAX

//1. AJAX란 무엇인가?
//약자
//	--> Asynchronous Javascript And XML
//자바스크립트의 비동기 통신(Ajax) 기술을 이용하여 외부에 있는 데이터를 읽어들인 후 웹페이지 HTML에 깜빡임 없이 반영하는 기술.
//웹페이지를 이동하지 않고도 서버 또는 외부에서 새로운 데이터를 받아오거나 전달할 수 있다.
//더 나은 사용자 경험을 줄 수 있기 때문에 모던 웹사이트 개발에 있어서 가장 중요한 기술 중 하나이며 최근에도 계속해서 새로운 기술이 업데이트
//외부의 데이터 파일은 기존의 XML에서 JSON파일로 거의 대체.
//발음
//	-->에이잭스, 아작스


//2. 학습자들은 왜 어렵게 느낄까?(Beginner)
//기본적으로 나오는 용어들이 IT입문자, 비전공자(문과생)들에게는 넘사벽이다.
//기본적으로 네트워크 관련된거는 무엇이든 복잡하다.
//	--> JSON, AJAX분류를 "네트워크" 카테고리로 분류하는 경우도 많다.
//환경설정이 초보자에게는 복잡하다.


//3. AJAX학습을 위한 환경설정은?
//서버가 필요하다.
//APM패키지, 라이브서버, 웹호스팅, 클라우드 서비스, 자체 서버 등등
//크롬 브라우저의 보안을 일시적으로 낮춰서 학습.


//4. 뭘 배워야 하나? 동시에 선수학습?
//기본적으로 동기, 비동기 통신 기술에 대한 개념이해가 되어 있어야 한다.
//JSON에 대한 개념이해, 변환 메서드 사용범, 기타 옵션 사용법
//기본적인 네트워크에 대한 이해.
//당연히 자바스크립트 기본 문법에 대한 이해.
//당연히 HTML, CSS코드 작성에 대한 기본 이상의 이해.(선택자 사용법)
